# Задание №5 - Формальное исполнение простого алгоритма

[← Вернуться к списку заданий](../README.md)

## 📋 Содержание
- [📖 Теория](#📖-теория)
- [🔍 Разбор](#🔍-разбор)
- [💡 Рекомендации](#💡-рекомендации)
- [⚠️ Типичные ошибки](#⚠️-типичные-ошибки)
- [📝 Рекомендованные задания](#📝-рекомендованные-задания)

---

## 📖 Теория

### 🔢 Основы систем счисления

**Система счисления** — способ записи чисел с помощью определённого набора символов (цифр).

#### 📊 Основные системы счисления

| Система | Основание | Цифры | Пример |
|---------|-----------|-------|--------|
| **Двоичная** | 2 | 0, 1 | 1101₂ = 13₁₀ |
| **Троичная** | 3 | 0, 1, 2 | 121₃ = 16₁₀ |
| **Восьмеричная** | 8 | 0-7 | 17₈ = 15₁₀ |
| **Десятичная** | 10 | 0-9 | 25₁₀ |
| **Шестнадцатеричная** | 16 | 0-9, A-F | 1A₁₆ = 26₁₀ |

### 🔄 Алгоритм перевода из десятичной в любую систему

**Метод "деления нацело":**
1. Делим число на основание системы счисления
2. Записываем остаток от деления (это младший разряд)
3. Частное снова делим на основание
4. Повторяем до тех пор, пока частное не станет равно 0
5. Записываем остатки **в обратном порядке**

**Пример:** 25₁₀ → троичная система

```
25 ÷ 3 = 8 остаток 1  ← младший разряд
8 ÷ 3 = 2 остаток 2
2 ÷ 3 = 0 остаток 2   ← старший разряд

Ответ: 221₃
```

### 💡 Как решать в уме (для небольших чисел)

**Для перевода в троичную систему:**
- Запомните степени тройки: 1, 3, 9, 27, 81, 243...
- Найдите наибольшую степень, не превышающую число
- Разложите число по степеням тройки

**Пример:** 25₁₀ → 3ⁿ
- 27 > 25, значит начинаем с 9
- 25 = 2×9 + 7 → коэффициент при 9 равен 2
- 7 = 2×3 + 1 → коэффициент при 3 равен 2  
- 1 = 1×1 + 0 → коэффициент при 1 равен 1
- **Ответ:** 221₃

### 🔄 Обратный перевод (из любой системы в десятичную)

**Формула:** результат = цифра₁×основание⁰ + цифра₂×основание¹ + ...

**Пример:** 221₃ → 10ⁿ
221₃ = 2×3² + 2×3¹ + 1×3⁰ = 2×9 + 2×3 + 1×1 = 18 + 6 + 1 = 25₁₀

---

## 🔍 Разбор

### 📝 Пример задачи: Алгоритм с троичной системой

**Условие:** На вход алгоритма подаётся натуральное число N > 9. Алгоритм строит новое число R:
1. Строится троичная запись числа N
2. Добавляются 3 разряда по правилу:
   - Если N делится на 4 → справа добавляются последние 3 цифры троичной записи
   - Иначе → слева добавляется "1", справа добавляется "20"

**Найти:** минимальное R > 423

### 💻 Готовое решение

```python
def conversion(x, base):
    n = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
    s = ''
    while x > 0:
        s = n[x % base] + s
        x //= base
    return s

m = []
for N in range(9, 1000):
    R = conversion(N, 3) 
    if N % 4 == 0:
        R = R + R[-3:]
    else:
        R = '1' + R + '20'
    R = int(R, 3)
    if R > 423:
        m.append(R)
print(min(m))
```

### 🔍 Разбор кода по шагам

#### **Шаг 1: Функция перевода в систему счисления**
```python
def conversion(x, base):
    n = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'  # все возможные цифры
    s = ''
    while x > 0:
        s = n[x % base] + s  # добавляем остаток в начало строки
        x //= base           # переходим к следующему разряду
    return s
```

**Как работает:**
- `x % base` — остаток от деления (цифра младшего разряда)
- `x //= base` — целая часть от деления (убираем младший разряд)
- Строим результат **справа налево**

**Пример:** `conversion(25, 3)`
- 25 % 3 = 1 → s = "1"
- 25 // 3 = 8
- 8 % 3 = 2 → s = "21" 
- 8 // 3 = 2
- 2 % 3 = 2 → s = "221"
- 2 // 3 = 0 → стоп

#### **Шаг 2: Основной алгоритм**
```python
for N in range(9, 1000):           # перебираем числа > 9
    R = conversion(N, 3)           # переводим в троичную
    if N % 4 == 0:                 # если N кратно 4
        R = R + R[-3:]             # добавляем последние 3 символа
    else:                          # иначе
        R = '1' + R + '20'         # добавляем '1' слева, '20' справа
    R = int(R, 3)                  # переводим обратно в десятичную
    if R > 423:                    # если результат больше 423
        m.append(R)                # добавляем в список
```

#### **Шаг 3: Примеры работы**

**N = 16 (кратно 4):**
- 16₁₀ = 121₃
- Последние 3 символа: "121" (вся строка)
- Результат: "121" + "121" = "121121"₃
- 121121₃ = 1×243 + 2×81 + 1×27 + 1×9 + 2×3 + 1×1 = 364₁₀

**N = 17 (не кратно 4):**
- 17₁₀ = 122₃  
- Результат: "1" + "122" + "20" = "112220"₃
- 112220₃ = 1×243 + 1×81 + 2×27 + 2×9 + 2×3 + 0×1 = 402₁₀

#### **Шаг 4: Поиск ответа**
```python
print(min(m))  # минимальное значение из всех R > 423
```

### 🎯 Ответ: 425

**Проверка:** Программа находит все R > 423 и выбирает минимальное значение.

---

## 💡 Рекомендации

В заданиях этой линии, как правило, требуется произвести простой анализ небольшого алгоритма, записанного на естественном языке. Для этого достаточно определить математическую или логическую закономерность, связывающую исходные данные и результат выполнения алгоритма.

### 🔧 Основные принципы решения:

1. **Анализ алгоритма** — понимание логики работы на естественном языке
2. **Поиск закономерности** — выявление связи между входными и выходными данными
3. **Тестирование на примерах** — проверка алгоритма на нескольких значениях
4. **Проверка результата** — верификация полученного ответа

---

## ⚠️ Типичные ошибки

### 🚫 Частые проблемы:

1. **Недостаточная внимательность** — ошибки из-за невнимательного чтения условия
2. **Отсутствие проверки** — непроверка полученного ответа
3. **Ошибки в двоичной арифметике** — неправильное выполнение операций с двоичными числами
4. **Поверхностный анализ** — неполное понимание алгоритма

### ✅ Как избежать ошибок:

- **Внимательно читайте условие** и описание алгоритма
- **Тестируйте алгоритм** на нескольких примерах
- **Проверяйте результат** подстановкой в исходный алгоритм
- **Повторите двоичную арифметику** при работе с соответствующими заданиями

---

## 📝 Рекомендованные задания

### 🔗 Какие задания открытого банка выполнить для тренировки

**Номера заданий из открытого банка ФИПИ:**

| № | Код | № | Код | № | Код | № | Код | № | Код |
|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|
| 1 | AB1E4C | 11 | 722F01 | 21 | D58576 | 31 | 910419 | 41 | 193F62 |
| 2 | FD04A7 | 12 | 1D46A1 | 22 | C707CC | 32 | BB72E5 | 42 | 1157D2 |
| 3 | B9FDF9 | 13 | D32E0F | 23 | 3FD674 | 33 | 4A5323 | 43 | A7196F |
| 4 | 7B8BAC | 14 | DBC2A3 | 24 | 89FBC4 | 34 | 579CE8 | 44 | D908DA |
| 5 | C30EF4 | 15 | 915A03 | 25 | C412B3 | 35 | A26623 | 45 | 6B6069 |
| 6 | 0D73A6 | 16 | 65B0A5 | 26 | 58BB95 | 36 | 84D6E3 | 46 | C13CDE |
| 7 | 930BF4 | 17 | 4D0976 | 27 | 44E412 | 37 | B2DDDD | 47 | 45033D |
| 8 | 6E67FD | 18 | DD38CF | 28 | ADF799 | 38 | 934CD4 | 48 | 790E31 |
| 9 | 181BA4 | 19 | FE3877 | 29 | 96F41A | 39 | 3C24DE | 49 | ACEE84 |
| 10 | D588C0 | 20 | 324C93 | 30 | 836BD5 | 40 | A22587 | 50 | CC6251 |
|    |        |    |        |    |        |    |        | 51 | E99281 |
|    |        |    |        |    |        |    |        | 52 | 675752 |

### 🌐 Как найти задания:

1. Перейдите на сайт **[fipi.ru](https://fipi.ru/ege/otkrytyy-bank-zadaniy-ege)**
2. Выберите **"Информатика и ИКТ"**
3. Найдите **"Задание 5"** в списке
4. Используйте **поиск по коду** задания (например, "AB1E4C")

### ⏱️ Контроль времени:

- **На экзамене** у вас будет 2-3 минуты на это задание
- **Отрабатывайте анализ алгоритмов** до автоматизма
- **Тренируйте двоичную арифметику** для соответствующих задач

---

---

[← Предыдущее задание](task-04.md) | [Следующее задание →](task-06.md)
